app/controllers/friendships_controller.rb

  def create
    #@friendship = Friendship.new(friendship_params):followed_id => params[:followed_id]
    @friendship = current_user.friendships.create(:followed_id => params[:followed_id],:follower_id => params[:follower_id])
---
INSERT INTO "friendships" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 2], ["follower_id", 4], ["created_at", "2015-04-19 18:01:52.617988"], ["updated_at", "2015-04-19 18:01:52.617988"]]