app/controllers/posts_controller.rb

  def index
    @user = current_user

    @posts = @user.posts.order("created_at DESC")
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY "posts"."created_at" DESC, created_at DESC  [["user_id", 4]]

  def show
    @post=Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 0]]

  def create

    # @post = current_user.posts.creat(post_params)
    @post = current_user.posts.create(:message => params[:message], :user_id=>params[:user_id])
---
INSERT INTO "posts" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "hello"], ["user_id", 4], ["created_at", "2015-04-19 18:01:42.000874"], ["updated_at", "2015-04-19 18:01:42.000874"]]