app/controllers/users_controller.rb

  def show

    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY "posts"."created_at" DESC  [["user_id", 4]]